INTRO_MESSAGE = (
    "Привет! Я ваш помощник по переводу и созданию словарных файлов. 🌟\n\n"
    "Я могу помочь вам с переводом английских слов и предложений, а также создавать файлы в формате CSV, "
    "которые легко можно импортировать в приложения для изучения слов. Вот что я могу сделать:\n\n"
    "1. Перевести английские слова и предложения на ваш язык.\n"
    "2. Сгенерировать файл в формате CSV с вашими переводами.\n"
    "3. Предоставить файл, который можно использовать в приложении для изучения слов.\n\n"
    "Выберите одну из команд ниже, чтобы начать:\n\n"
    "• /multiple_translation – Перевести несколько слов и предложений.\n"
    "• Мои темы – Просмотреть доступные темы.\n"
    "• /csv – Перевести текст и создать CSV файл.\n"
    "• Моя статистика – Просмотреть вашу статистику.\n\n"
    "Если у вас возникли вопросы или предложения, просто напишите мне! 📩"
)


MULTIPLE_TRANSLATION_MESSAGE = (
    "Вы выбрали множественный перевод! 🌟\n\n"
    "Пожалуйста, выберите разделитель для списка слов из следующих вариантов:\n\n"
    "• **Запятая** (например: слово1, слово2, слово3)\n"
    "• **Пробел** (например: слово1 слово2 слово3)\n"
    "• **Перенос строки** (например:\n\n"
    "  слово1\n"
    "  слово2\n"
    "  слово3)\n\n"
    "**Совет:** Такие списки слов удобно генерировать через ChatGPT или другие текстовые инструменты.\n\n"
    "После выбора разделителя, отправьте список слов, разделённых указанным разделителем. Если вам нужно вернуться в главное меню, используйте соответствующую кнопку."
)